app/views/staffs/index.html.erb

SELECT "staffs".* FROM "staffs" WHERE (lower(first_name) like 'an%' OR lower(last_name) like 'an%' OR lower(email) like 'an@inntoac.com') ORDER BY lower(email) = 'an@inntoac.com' desc, last_name asc
---
  </aside>
  <section class="search-results" ng-if="staffs.length > 0">