app/views/kudos/_kudo.html.erb

    <span class="glyphicon glyphicon-user" aria-hidden="true"></span>
    <%= Staff.find_by_email(kudo.sender).first_name %> <%= Staff.find_by_email(kudo.sender).last_name %>
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."email" = $1 LIMIT $2  [["email", "an@innotac.com"], ["LIMIT", 1]]

    <span class="glyphicon glyphicon-user" aria-hidden="true"></span>
    <%= kudo.staff.first_name %> <%= kudo.staff.last_name %>
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 6002], ["LIMIT", 1]]