app/controllers/dashboard_controller.rb

SELECT  "staffs".* FROM "staffs" WHERE "staffs"."email" = $1 LIMIT $2  [["email", "an@innotac.com"], ["LIMIT", 1]]
---
  def index
    $curUserStaff = Staff.find_by_email(current_user.email)