app/controllers/kudos_controller.rb

SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 6002], ["LIMIT", 1]]
INSERT INTO "kudos" ("sender", "message", "staff_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sender", "david@innotac.com"], ["message", "Long weekend!!! Yay"], ["staff_id", 6002], ["created_at", 2016-09-01 21:59:59 UTC], ["updated_at", 2016-09-01 21:59:59 UTC]]
---
  def create
    @staff = Staff.find(params[:staff_id])
    @kudo = @staff.kudos.create(
        sender: current_user.email,
        message: kudo_params[:message])

SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 6003], ["LIMIT", 1]]
SELECT  "kudos".* FROM "kudos" WHERE "kudos"."staff_id" = $1 AND "kudos"."id" = $2 LIMIT $3  [["staff_id", 6003], ["id", 4], ["LIMIT", 1]]
DELETE FROM "kudos" WHERE "kudos"."id" = $1  [["id", 4]]
---
  def destroy
    @staff = Staff.find(params[:staff_id])
    kudo = @staff.kudos.find(params[:id])
    kudo.destroy