app/controllers/staffs_controller.rb

  def index
    @page = (params[:page] || 0).to_i
    if params[:keywords].present?
      @keywords = params[:keywords]
      staff_search_term = StaffSearchTerm.new(@keywords)
      @staffs = Staff.where(
          staff_search_term.where_clause,
          staff_search_term.where_args).
          order(staff_search_term.order).
          offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
---
SELECT  "staffs".* FROM "staffs" WHERE (lower(first_name) like 'david%' OR lower(last_name) like 'david%' OR lower(email) like 'david@innotac.com') ORDER BY lower(email) = 'david@innotac.com' desc, last_name asc LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

  def show
    @staff = Staff.find(params[:id])
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 6004], ["LIMIT", 1]]

  def sndkudo
    @staff = Staff.find(params[:id])
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 6004], ["LIMIT", 1]]

  def create
    @staff = Staff.new(staff_params)

    if @staff.save
---
INSERT INTO "staffs" ("first_name", "last_name", "title", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Jane"], ["last_name", "Doe"], ["title", "CEO"], ["email", "jane@somewhere.net"], ["created_at", 2016-09-04 19:30:15 UTC], ["updated_at", 2016-09-04 19:30:15 UTC]]

  def erstaff
    @staff = Staff.find(params[:id])
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 6003], ["LIMIT", 1]]

  def edit
    @staff = Staff.find(params[:id])
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 6003], ["LIMIT", 1]]

  def update
    @staff = Staff.find(params[:id])

    if @staff.update(staff_params)
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 6005], ["LIMIT", 1]]
UPDATE "staffs" SET "title" = $1, "updated_at" = $2 WHERE "staffs"."id" = $3  [["title", "CIO"], ["updated_at", 2016-09-04 19:31:05 UTC], ["id", 6005]]

  def destroy
    @staff = Staff.find(params[:id])
    @staff.destroy
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 5633], ["LIMIT", 1]]
DELETE FROM "staffs" WHERE "staffs"."id" = $1  [["id", 5633]]